org-files/minetest.org
:PROPERTIES:
:ID:       940910ef-9064-4f2a-965f-1a80358f45d9
:END:
#+title: minetest
#+STARTUP: overview
#+date: 2025-05-26

*** Comandos

**** Privilegios (Usuarios)
- Personal ~/grantme Priv~
- Usuario ~/grant user Priv~

**** Privilegios (Lista)
| Descripción       | Argumento |
|-------------------+----------|
| Vuelo             | fly      |
| Modo creativo     | creative |
| Movimiento rápido | fast     |
| Atravesar bloques | noclip   |

**** Tiempo
| Descripción      | Comando              |
|------------------+----------------------|
| Velocidad normal | ~/set time_speed 72~ |
| Tiempo parado    | ~/set time_speed 0~  |
| Medio día        | ~/time 6000~         |
| Despejado        | ~/weather clear~     |

**** Objetos
| Objetivo                               | Comando                  |
| -------------------------------------- | ------------------------ |
| Eliminar todo (Monstruos, ovejas...)   | ~/clearobjects~          |

**** Daño
| Descripción                      | Comando                    |
|----------------------------------+----------------------------|
| Desactivar daño temporal         | ~/set enable_damage false~ |
| Desactivar ataque entre usuarios | ~/set enable_pvp false~    |

/creative on          # Activar modo creativo
/creative off         # Desactivar modo creativo


*** Crear un mapa con https://github.com/luanti-org/minetestmapper

Instalar dependencias ~sudo apt install cmake libgd-dev libhiredis-dev libleveldb-dev libpq-dev libsqlite3-dev zlib1g-dev libzstd-dev~
Descargar la última versión de https://github.com/luanti-org/minetestmapper
Descomprimir ~unzip minetestmapper-master.zip~
Instalar dependencias ~sudo apt install build-essential -y~
Compilar
  cmake . -DENABLE_LEVELDB=1
  make -j$(nproc)



Cambiar el archivo colors.txt por https://github.com/yrungr/mineclone2mapper/blob/master/colors.txt


./minetestmapper -i ~/dockers/minetest/data/worlds/world/ -o map.png --zoom 4


*** Servir el mapa como losetas

Instala la herramienta:

sudo apt update
sudo apt install -y libvips-tools


Lanza el “tileado” (256×256 por defecto):

vips dzsave map.png tiles/map \
  --suffix .png \
  --tile-size 256 \
  --overlap 0


Esto crea:

tiles/map.dzi (descriptor)

tiles/map_files/ (carpetas por niveles con los tiles)


2) Verlo en el navegador con OpenSeadragon

Crea un index.html junto a la carpeta tiles/ con este contenido mínimo:

<!doctype html>
<html>
<head>
  <meta charset="utf-8" />
  <title>Mapa MineClone2</title>
  <style>html,body,#viewer{height:100%;margin:0}</style>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/openseadragon/4.1.1/openseadragon.min.js"></script>
</head>
<body>
  <div id="viewer"></div>
  <script>
    OpenSeadragon({
      id: "viewer",
      prefixUrl: "https://cdnjs.cloudflare.com/ajax/libs/openseadragon/4.1.1/images/",
      tileSources: "tiles/map.dzi",
      showNavigator: true
    });
  </script>
</body>
</html>

3) Servirlo (servidor estático)

Desde la carpeta donde está index.html:

python3 -m http.server 9000


Y abre en tu navegador: http://IP_DEL_SERVIDOR:9000

Ventajas: no necesitas georreferenciar nada, soporta zoom fluido y solo con un HTML.
