public_html/minetest.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-20 vie 12:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>minetest</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">minetest</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8df61dd">1. Comandos</a>
<ul>
<li><a href="#orgcb67b08">1.1. Privilegios (Usuarios)</a></li>
<li><a href="#org04b26bd">1.2. Privilegios (Lista)</a></li>
<li><a href="#orgf382335">1.3. Tiempo</a></li>
<li><a href="#org6f1b61b">1.4. Objetos</a></li>
<li><a href="#org76feeb3">1.5. Daño</a></li>
</ul>
</li>
<li><a href="#org81c3b42">2. Crear un mapa con https://github.com/luanti-org/minetestmapper</a></li>
<li><a href="#org49774db">3. Servir el mapa como losetas</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8df61dd" class="outline-2">
<h2 id="org8df61dd"><span class="section-number-2">1.</span> Comandos</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcb67b08" class="outline-3">
<h3 id="orgcb67b08"><span class="section-number-3">1.1.</span> Privilegios (Usuarios)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Personal <code>/grantme Priv</code></li>
<li>Usuario <code>/grant user Priv</code></li>
</ul>
</div>
</div>

<div id="outline-container-org04b26bd" class="outline-3">
<h3 id="org04b26bd"><span class="section-number-3">1.2.</span> Privilegios (Lista)</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Descripción</th>
<th scope="col" class="org-left">Argumento</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Vuelo</td>
<td class="org-left">fly</td>
</tr>

<tr>
<td class="org-left">Modo creativo</td>
<td class="org-left">creative</td>
</tr>

<tr>
<td class="org-left">Movimiento rápido</td>
<td class="org-left">fast</td>
</tr>

<tr>
<td class="org-left">Atravesar bloques</td>
<td class="org-left">noclip</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf382335" class="outline-3">
<h3 id="orgf382335"><span class="section-number-3">1.3.</span> Tiempo</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Descripción</th>
<th scope="col" class="org-left">Comando</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Velocidad normal</td>
<td class="org-left"><code>/set time_speed 72</code></td>
</tr>

<tr>
<td class="org-left">Tiempo parado</td>
<td class="org-left"><code>/set time_speed 0</code></td>
</tr>

<tr>
<td class="org-left">Medio día</td>
<td class="org-left"><code>/time 6000</code></td>
</tr>

<tr>
<td class="org-left">Despejado</td>
<td class="org-left"><code>/weather clear</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6f1b61b" class="outline-3">
<h3 id="org6f1b61b"><span class="section-number-3">1.4.</span> Objetos</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Objetivo</td>
<td class="org-left">Comando</td>
</tr>

<tr>
<td class="org-left">--------------------------------------</td>
<td class="org-left">------------------------</td>
</tr>

<tr>
<td class="org-left">Eliminar todo (Monstruos, ovejas&#x2026;)</td>
<td class="org-left"><code>/clearobjects</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org76feeb3" class="outline-3">
<h3 id="org76feeb3"><span class="section-number-3">1.5.</span> Daño</h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Descripción</th>
<th scope="col" class="org-left">Comando</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Desactivar daño temporal</td>
<td class="org-left"><code>/set enable_damage false</code></td>
</tr>

<tr>
<td class="org-left">Desactivar ataque entre usuarios</td>
<td class="org-left"><code>/set enable_pvp false</code></td>
</tr>
</tbody>
</table>

<p>
/creative on          # Activar modo creativo
/creative off         # Desactivar modo creativo
</p>
</div>
</div>
</div>


<div id="outline-container-org81c3b42" class="outline-2">
<h2 id="org81c3b42"><span class="section-number-2">2.</span> Crear un mapa con <a href="https://github.com/luanti-org/minetestmapper">https://github.com/luanti-org/minetestmapper</a></h2>
<div class="outline-text-2" id="text-2">
<p>
Instalar dependencias <code>sudo apt install cmake libgd-dev libhiredis-dev libleveldb-dev libpq-dev libsqlite3-dev zlib1g-dev libzstd-dev</code>
Descargar la última versión de <a href="https://github.com/luanti-org/minetestmapper">https://github.com/luanti-org/minetestmapper</a>
Descomprimir <code>unzip minetestmapper-master.zip</code>
Instalar dependencias <code>sudo apt install build-essential -y</code>
Compilar
  cmake . -DENABLE<sub>LEVELDB</sub>=1
  make -j$(nproc)
</p>



<p>
Cambiar el archivo colors.txt por <a href="https://github.com/yrungr/mineclone2mapper/blob/master/colors.txt">https://github.com/yrungr/mineclone2mapper/blob/master/colors.txt</a>
</p>


<p>
./minetestmapper -i ~/dockers/minetest/data/worlds/world/ -o map.png &#x2013;zoom 4
</p>
</div>
</div>


<div id="outline-container-org49774db" class="outline-2">
<h2 id="org49774db"><span class="section-number-2">3.</span> Servir el mapa como losetas</h2>
<div class="outline-text-2" id="text-3">
<p>
Instala la herramienta:
</p>

<p>
sudo apt update
sudo apt install -y libvips-tools
</p>


<p>
Lanza el “tileado” (256×256 por defecto):
</p>

<p>
vips dzsave map.png tiles/map \
  &#x2013;suffix .png \
  &#x2013;tile-size 256 \
  &#x2013;overlap 0
</p>


<p>
Esto crea:
</p>

<p>
tiles/map.dzi (descriptor)
</p>

<p>
tiles/map<sub>files</sub>/ (carpetas por niveles con los tiles)
</p>


<ol class="org-ol">
<li>Verlo en el navegador con OpenSeadragon</li>
</ol>

<p>
Crea un index.html junto a la carpeta tiles/ con este contenido mínimo:
</p>

<p>
&lt;!doctype html&gt;
&lt;html&gt;
&lt;head&gt;
  &lt;meta charset="utf-8" <i>&gt;
  &lt;title&gt;Mapa MineClone2&lt;/title&gt;
  &lt;style&gt;html,body,#viewer{height:100%;margin:0}&lt;/style&gt;
  &lt;script src="<a href="https://cdnjs.cloudflare.com/ajax/libs/openseadragon/4.1.1/openseadragon.min.js">https://cdnjs.cloudflare.com/ajax/libs/openseadragon/4.1.1/openseadragon.min.js</a>"&gt;&lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
  &lt;div id="viewer"&gt;&lt;/div&gt;
  &lt;script&gt;
    OpenSeadragon({
      id: "viewer",
      prefixUrl: "<a href="https://cdnjs.cloudflare.com/ajax/libs/openseadragon/4.1.1/images">https://cdnjs.cloudflare.com/ajax/libs/openseadragon/4.1.1/images</a></i>",
      tileSources: "tiles/map.dzi",
      showNavigator: true
    });
  &lt;/script&gt;
&lt;/body&gt;
&lt;/html&gt;
</p>

<ol class="org-ol">
<li>Servirlo (servidor estático)</li>
</ol>

<p>
Desde la carpeta donde está index.html:
</p>

<p>
python3 -m http.server 9000
</p>


<p>
Y abre en tu navegador: <a href="http://ip_del_servidor:9000">http://ip_del_servidor:9000</a>
</p>

<p>
Ventajas: no necesitas georreferenciar nada, soporta zoom fluido y solo con un HTML.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-05-26</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 12:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
